number=int(input())
number2=int(input())
for num in range(number, number2 +1):

    print(chr(num), end=" ")



#Задачата отпечатва всеки символ който съответства на зададеното от мен число